supreme
Poppea
Creon
small-time
whence
Drydock
Zinc
OSF
divestiture
14.32
Rotberg
NY
Board/Merc
Goetz
naively
Latzer
post-colonial
twenty-one
gigahertz
319.9
Utsumi
deconstructionists
abaca
1,380
STEIN
teen-aged
redouble
fresh-produce
Granath
casino-industry
8.61
Harmon/Envicon
doze
Westford
auto-worker
6.375
ATTRACTS
prefab
Bulova
Annibale
probings
COMPREHENSIVE
Hinzack
Claud
Combined
77-a-share
Marlon
smelted
3,260
money-saving
thus
Supersonics
above-board
particle-beam
family-run
hand-modeling
Mirroring
asks
68.73
imagines
50.49
landlord
Renewed
Glassman
368.5
CIC.
PDM
MiG-27
Charta
GE-brand
kings
Launer
time-management
Herbfarm
mechanistic
4.93
397.1
miller
Touted
Micron
Yields
8.34
Finanziamento
Posturing
customizing
Orgotein
PayPoint
Ind.-based
119.69
minicomputers
gift-giving
dieter
Vadim
Kromboom
tweaking
Settlements
1.9544
IBES
Dalhouse
AY
2,270
Vissoka
plumbing-products
ALFONSIN
3,068,167
Tron
faltered
juniors
5,020
Cody
16.38
German-American
PLANNERS
Hula-Hoops
Profiles
WALDHEIM
praying
Jusco
Electro
Requirements
Shaklovity
community
Mohawks
graphs
Syscon
press-relations
Harlyn
NISSHO
reformer
cheapens
Tannen
410
Actions
Vitebsk
miltary
divulge
better-heeled
shampooing
Insolvent
active-duty
luxurious
Apostolakis
Knapp
used-car
consents
ATM
Cowell
Play
CHIP
16.61
Upson
Directly
ours
Positive
Echlin
Faucet
42nd
8.25-a-share
McElhaney
Malpede
bliss
riled
Kincannon
Moosehead
alias
academics
Dermatologists
Bauer
PLAY
826.7
fibers
Maung
apartment
hypertext
Dayton-based
Schrage
intolerably
Burry
ex-military
bankers
banisters
AWA
MONARCH
taxes
Willcock
breeze
crapshooters
Marcoses
Gottfried
Choraria
Fogel
scramblers
3.4638
506th
defense-contract
businessess
undergoing
PharmaKinetics
Fanjul
Norrie
115.2
resentment
creative
Welding
cubits
87-16
Directive
warriors
CONSTRUCTION
federally
Seventy-four
2268.98
Dior
Tarts
Kidney
Palette
USG
469.6
furnishes
Cathleen
Snedeker
strategize
prince
mainlander
Spectra
impairing
LIBOR
Prothro
Brainsby
EARNINGS
rollouts
Carman
firebrand
time-tested
2,227,500
moderate
8.1
WRU
49.50
Myles
ribonucleic
179.47
charming
245,000
twister
Recio
51.5
Grabowski
Overuse
Frommer
servicewomen
Slyke
bannered
Cary
Web
current
Selectol
technology-exchange
Grammys
STRATEGY
1.8768
attainments
Martonik
fated
9.56
keyhole
Stillwaggon
Phoebe
Risky
Skidelsky
Driker
allergies
Homeric
sailing
infelicitous
new-issue
Brookline
trade-law
Travicom
1/32
Labinal
donnas
hollered
Lesser-known
staved
YKK
husbandly
atmospherics
bad
Smaltz
homoerotic
100-plane
McKeesport
Camco
0.0100
gaily
Mendell
Saia
Dietrich
xerographic
solving
Spanish-speaking
runt
shafted
invading
Depends
Sciarrino
artists.
Sirowitz
spilled
cash-and-debenture
pinch-hit
crosses
compulsive
4,585,000
Phosphates
Cornelis
millennialist
Ivers
cologne
soared
issuance
Tallant/Yates
resolving
300,000-share
14.08
Hedda
23.53
pluralities
recentralization
Artkraft
shallower
pettiness
COALITION
hitchhiking
Bitumen
196.3
miss
much-reduced
Collections
retirement-community
TRY
well-acquainted
Pathe
Mosquitia
tons
learn
negotiation
Masonry
chamber-of-commerce
HUDSON
ICEE-U.S.A.
vein
Inevitably
Coulombe
1857
21.50
feature-film
outdoor-equipment
Ranney
Sunami
aggregated
mid-1970s
Wola
text-management
6,810
unease
Warner-Lorimar
paleolithic
nurses
open-access
debtors
Messerschmitt-Bolkow-Blohm
allegorical
mignon
357.8
streamers
SCHWEPPES
MacSharry
flopped
Lewistown
paperback
impost
Schlueter
Silesian
2299.4
Plummeting
ardent
carps
forbiddingly
Rehman
better-tasting
Regulations
diplomas
Nukes
legislatures
Conover
Youngstown
Apology
expanding
readings
consortia
cargos
Wineheim
Kilty
co-headed
single-story
409.9
APAC-Arizona
dilation
president-administration
Shifting
furlongs
15-million
Zech
Spoons
Tadzhik
Guidelines
Atkins
revelry
windsock
seamstresses
Cordin
Imre
Ales
1284.70
Antoon
doorbells
Roulston
Cabrini-Green
quadrant
A4
Peasback
5,950,000
65.16
Comment
placebos
stub
Highflying
harmonizing
Blakely
THINKING
profiteer
bow-tied
Guido
Gautier
dehumanize
Cycolor
eye-wear
bikes
.38-caliber
35-count
Thatcherism
walruses
nine-year-old
Mademoiselle
390.30
2337.08
vagaries
fiveyear
15-18
'82
374.60
unfounded
Republicbank
Halladay
Cockerill-Sambre
hospitalized
modernist
Santangelo
35.21
second-period
Gundy
banked
190.9
Nurol
Miyagawa
predated
veal
illgotten
tannic
Zeccardi
impersonator
frighten
aunt
53-47
Vimond
147.50
Erlangen
DECWorld
foreign-assistance
non-commercial
billeted
Matuschka
municipal-course
Epidemiology
2090.68
Roufus
incontrovertible
Scholz
Feffer
-to-35
misjudging
Riverfront
heave
Crichton
equipments
anteater
Winterset
STARTING
195.9
11
22-hour
topics
Paolucci
Junction
6.71
Mauriac
BioAdvance
EFI
CNOOC
air-passenger
Leverkusen
tentative
19.9
Non-accrual
0.075
high-desert
M3
paraphrasing
Moloney
Reasonable
droppers
risque
Tel-Thermco
low-scoring
reptilian
dirt-floor
BRUSSELS
Shirt
sincerity
Yamanouchi
Wyomissing
growth-hormone
computer-service
Rayas
homily
Venetian
commiserated
once-banned
Dobi
Polygraph
headlined
Violence
Sestanovich
Guida
clearing-house
1.6977
caver
green-clad
14,610,000
immaculately
superintendent
Planting
61.59
108,346
Rockingham
preceding
Avibras
rootedness
prostrate
two-team
14-June
Parent
unacknowledged
supervised
Controllers
darvon
Gopnik
1,344
395.3
publicans
DIVIDEND
GMI
honeyed
Cox
control-tower
668.2
Pere
Ul-Haq
Investissements
pretension
smacked
Pooley
POSNER
27-year
80-
psychoanalytic
Forests
Peaceable
accomplishing
16.0
waft
nudges
Cipriani
constitutionalist
airspaces
Mironenko
Year-round
2243.20
campers
5.28
Tevye
ANDERSON
pointlessly
Electro-Module
gravy
Internacional
avoiding
Support
psychedelic
vacate
Gray-market
MOGOOOO
Gurney
150-point
Mondiales
Encounters
1330
witty
evinces
Sunflower-seed
Myhre
lock-step
teens
Cissy
not-Orthodox
taken
860,998
Toshiba-Motorola
disciplines
Craighill
32.875
0.78
Rafeedie
McColl-Frontenac
Melman
assigns
Coseka
Clusters
Tetuan
Cashing
Fiddler
do-gooders
reversions
Graafeiland
retrace
behavior
CNN
456.4
DynCorp
Edgewood
College-educated
DISCUSSED
materiel
1916
northbound
hot-fat
Armando
sub-specialty
glue
Invaders
Levenson
muzzled
INTELLIGENCE
Valdosta
finish
Riera
Bulk
heavy-machinery
unconvincing
impotent
Conergics
wood-based
Supplement
32.56
1297.58
wheeling
Tele-Trip
hovered
Vassos
stomp
Yank
AMF
Tasmania
Habit
San/Bar
bond-financed
semigovernmental
Predominantly
drugstore
stoke
Jubilee
Balthus
Funai
Woodard
door-opening
Network
Tenders
16.40
buff
Thyssen
provocatively
2,800-member
FINALLY
riches
Wolff
stamping
mislabeling
empathizes
current-coupon
Patna
81st
bailing
ruggedly
79,300
Anderluh
Centran
Mark-denominated
mangrove
Ektachrome
gallantly
Waving
Phoenix-based
Kriegel
thoughtless
Starbuck
air-cooled
rate-payers
Tose
Motif
putative
Grgich
tarps
J-platform
Ranelli
Glass-Steagall
Column
wife.
crudeoil
Cash-basis
Villanova
enthuses
Ordained
Prudential-Bache
138,000
404.60
Antilles-based
triples
radio-frequency
Levitas
suburbanites
2342.19
concept
cellular-phone
credible
189.8
2.601
invasions
1.163
SeaWest
2108.46
Deveny
specialty-machinery
Comp-U-Card
masking
ornithologist
compartmentalization
853.35
cold-shower
Sqaud
Monder
mishandling
grain-handling
153.71
Tavern
Amvisc
likened
516.1
weak-dollar
equity-market
skinhead
Javanese
715.3
catching-up
1,010,000
Unifil
CH-53
pimentos
CARE
Overwhelming
supercharger
aped
Credithrift
Reagan-administration
Untouched
netherworld
280.8
Marren
Business-cycle
Mauritania
POSE
anti-nausea
409.10
hard-liners
Kosner
Naturalization
Kassa
carefree
nonlinear
realigned
648.1
36-year-old
mini-dolls
Pasqual
46.6
florists
out-of-context
anticipate
67.875
3,228
160.8
scholar
pressure
Burgio
Hatchback
Martoche
triple-A
asymptomatic
achieving
FERC-ordered
McKoy
972
Petrograd
Bristling
6.625
151.1
illegitimacy
Cawsl
Greenwell
157-point
most-actives
AGT
2492.82
Hurrem
senior-management
rounder
1634
Ulyanovsk
underserved
check-overdrafting
company-paid
knowledgeable
Transrapid
wielding
5,300
FlowMole
comfortably
82.4
400-an-ounce
Inlet
19th-largest
lieu
nonpolitical
anarchy
gas-development
216,000
AUTHORIZED
Sculptor
jauntily
petroleum-producing
sensationalized
leaching
Himmelfarb
odder
video-game
Chongqingians
191.7
bluffing
Deposits-a
Publishing
Chewing
Neeco
glasses
Wiseguy
R.W.
oddballs
5,000-ounce
waste-hauling
chomped
much-awaited
promote
Watervliet
Trinova
Residues
glacially
lifeblood
Branitzky
Rama
Newbury
Rogerio
grove
recounted
franchised
Grax
Snowbeck
yarmulkes
hypersensitivity
free-standing
flower-power
biologics
destitute
Noramco
Monadnock
May-September
Pagliacci
hot-weather
Senate-House
reminiscent
TRITON
cider
Bantu
Behrendt
in-laws
foreign-government
Fuente
Cult
Inability
Schorling
ITT
weariness
ingenuously
Refused
cabernets
Injustice
third-most
Rexburg
sybaritic
Orlando-based
7-Up
colloquialisms
inputs
Almost
Moonjian
Yemeni
adept
Kapok
RCA
Starts
ultra-low-tar
al-Otaiba
Pakzad
15.69
Manning
export-screening
targeted
!!
27.52
mooted
aflutter
cocoon
impediment
Bajda
wick
internationally
SpaghettiO
Chuangzhi
radiometer
0.3
expands
general-equivalency
junket
imbecility
trigger-price
Midcon
Dukakis-Bentsen
seductive
14-year
Salute
Honey
Citadel
formulary
Faxit
246.7
Freaky
Teradyne
T.R.
Oppenheimer-Palmieri
atmosphere
Hydron
1738
1.87
everyday
firma
Goodkind
Hapeville
acqusitions
Pentagon-procurement
enchanting
Platte
Keyboard
PRODUCING
Blank
golden-yellow
ganciclovir
energy-rich
Spectators
029
custom
Grist
vie
square-toed
Costantine
Nattapol
purveyed
forgot
byline
Refaat
Alfaro
gradient
Ralphs
Stimela
toured
366.8
Synthetics
Beatie
Shiko
Boonville
Faraday
Meskill
Nash-Kelvinator
blazingly
telescopic
randomness
out-Volcker
monthlong
confusing
masterminded
postpones
Vaux
THE
366.20
Carl-Gustaf
Soeren
Hampstead
gratis
below-prime
sheltering
Coast
collar
Oshkosh
Keener
Yoffie
fogeyism
Heaviest
Association/College
97.125
gaggles
Envos
drug-store
Swierenga
clauses
Aguacate
1,730
59.9
10,350
off-highway
Lynum
12.85
violinists
Le-Israel
Commtron
pulls
26.28
Shuberts
compilation
skinheads
8.025
OCS
Simplicity
Olinger
672,093
Parmenter
1494.3
Metrotech
Skynyrd
Staten
motion-control
714
9.20
Ople
human-wave
Discourse
56.50
More-liberal
AC-130U
388.5
amendment
Fringe
Quintron
640.9
unroll
Tejon
Leonard-Donny
unadventurous
tax-compliance
ARCHITECT
anti-selection
non-trade-related
Norand
head.
260.9
Jeeps
oligopolistic
fair-share
NKK
Katz
normalization
Brautigam
droned
lavish
pet-supplies
Sexiest
Potsdam
Mikelson
months.
130,812
sputters
blurting
Haffenreffer
98.05
Latortue
Waterbury
Lakers
WIFE
advertisement
buffeting
Airlift
grills
Seydoux
124.52
iliac
slavishly
Onward
habitat
fractures
saleswoman
Mellanby
Amouage
forthright
Verifine
56-story
355,200
goal-setting
Lambesis
Kaffen
R.D.
Abordo
Toyco
1299.33
Hearings
encloses
AM-radio
Kapel
assisted
26.875
18.18
censors
noirs
Styling
Vorwerk
726.9
entomology
Kimberling
5,590
347.01
Realized
Satins
car-pricing
Horatius
Burma
sanctify
1.3625
Francesconi
24,700
Xydex
lonelier
Sprott
unconstitutionally
successors
tooling
Hoop
Feldene
Shoulders
22,600
mushrooms
subsidization
Inamori
trumpeter
dozing
Moorehead
1984-1985
titleholder
Reduced
non-whites
Brust
Classrooms
939,000
1,522
prick
sober-minded
woof
Bizarre
targets
Royer
tranquilizing
ORS
DieHard
Register
borrower-owned
embargoing
attractant
roman
tourists
storeowners
purchases
Doeyan
Kingsepp
Stainmaster
Parti
revenue-raising
4,270
saws
LICKING
Downington
Tuckahoe
Orkay
pathfinder
secretary-of-state
BOJ
PR
slurpy
convention-center
frontline
encrusted
bolted
Bickley
612.5
MacLeod
Signal
nation
Albertson
less-frequent
CARNEGIE
II-era
148.83
2,369,600
Potomac
power-utility
skilled-trades
chin-up
Oakton
Bernd
valorous
Jolson
overhung
Henninger
inattentive
anisotropy
revolvers
35-page
cowed
Fort
Wastes
886.7
utilization
latent
mistakenly
Joffe
cassock
infinitesimal
astonishes
electrification
Cole
Collier
jades
Essman
pattern-recognition
tempos
Primis
pay-incentive
878
contortionist
costly
Democratica
prescribing
Mag
deregulate
reasons.
Televised
gilding
2056.37
76,500
Generic-Drug
84-acre
4,639
Trespalacios
Dictator
Bloggs
2,362
ameliorated
53,300
catalogued
ocean-shipping
Laymen
non-qualified
grids
hut
accentuating
argumentation
ameliorate
skylines
Suburbanites
caulking
47.17
bee
Greaux
Lynner
conceiving
concubinage
1941.48
Smart
Wiesner
559.6
Pennzoil-Getty
blue-collar-mail
eight-week
PLP
Osiatynski
chapped
27.40
FNM
320.1
Cheeseburgers
Spence
redesignation
oilcloth-covered
urgency
Ajit
Handotai
circulation
schoolgirl
1979-1987
emphysema
noise
Marangakis
disinfecting
Sparked
4.06
firecrackers
desuetude
254-158
tendering
agressively
late-hour
Deeks
Gartner
peonage
school-age
uncooperative
snobby
Poppenberg
Marcos
MURDER
--
ice-cold
Hevi-Duty
Palmtag
spillage
Popieluszko
buzzers
agile
Nimes
Zoeller
Trading
graveyard
DISKS
publishing-industry
interest-charge
baby-sit
population-poor
Boston-Credit
Bristol
inflicted
tax-exempt
145.00
1,184
Lickle
French-made
447.90
dawns
26.88
conserves
274.4
MacEwan
layoffs
855,000
12.9
recessions
CLC
254.9
1,970
mow
Gutenstein
double-decker
Leblanc
exhortation
Planitzer
fluently
Auffenberg
Well
Shiraa
suitcases
28.7
16/64-inch
Arpad
Biddle
174,000
Summey
Kennon
pawed
DIRECT
LoveSexy
Interlego
Intimate
Shoreham
USDA
industrialize
defiling
oops
Easco
IMU
wheelbarrows
Obstfeld
Yom
FILED
Eckersley
near-total
nuclear-test
Molecules
Paata
printed-circuit
Providers
.the
duplicator
Hapsburgs
good-faith
re-emergence
Rounding
Cosell
Kampmann
Cherpak
Interagency
chaser
excusing
Dismissed
rhythms
Cocker
mineral
felt-tip
Rini
Tipton
McCrea
coliseum
double-counting
MarketNet
commodity-oriented
speeded-up
heap
Abstaining
Lancelot
Services
heal
tritium
78.04
show-cause
Goldfus
first-shift
Chillum
husband-and-wife
1,032
browsed
Transmark
Kollsman
Paddock
DeWein
Lorean
Sunworld
Arterberry
billion-bushel
Slick
substituted
austerity
LeClair
5.40
Tavist
SBC
anxious
Sharma
aurora
widely
processes
6.5-month
Segalas
5-Aug.
Delphic
Philips/Du
Ponnelle
404,000
anti-national
Envelope
B-17
Wynter
486,000
Redonda
Climaco
7.
ogled
procrastinating
single-person
Long-range
Impotents
245,500
Hard-working
LEMON
cello
100-odd
Beltway
Bolstering
rhapsody
Demento
empowered
phone-equipment
powering
progressivity
106.1
fold
Telecrafter
imputed
round-the-world
Orkin
personalization
136.31
Mansell
Browsing
98.85
single-dish
editor-in-chief
counteroffers
lozenges
Worst
Museum
Emmys
McGurk
Disney-MGM
10th-grade
seabed
GAIN
Bullion
onlooker
diplomacy
Barrick
compatibility
Gogol
Beauchamp
aplomb
Jacopo
counterpunch
20.39
queens
Valenzuela
Pixar
wheedling
1/100th
organs
410,700
weekend
Lattanzi
3.9
1.49
87.50
1.8933
REGIONAL
HOUSEHOLDS
Emperor
Montour
Stalling
child-custody
voiding
RISE
centrist
triggered
satellite-launcher
104th
distorting
gp
146.20
452.9
tumors
inconsequential
Perrins
Together
spew
synthetically
multitasking
Duration
stuffed
free-form
sacredness
7.89
Francorp.
incompatibility
dispensable
22.17
red-lined
two-year-long
26.
fester
Top-level
remit
12.2
readier
28,855
95.46
451
why
Transceptor
Econometrix
Kummer
Kochka
Zaffuto
Wick
Lindley
Cunard
270.52
CERUS
absentee
sterner
role-playing
Shuch
Sarokin
motorcycle
phoning
Rudiger
recover
Gersh
52-card
Cafe
infer
oil-reserve
IMOFO
tricky
Ferroviaria
Everywhere
Meredith
4,546,245
micromanaging
big-game
dissertation
abnormals
diggers
54.6
hurts
Kenichi
Tupken
touting
untendered
commercialism
sunburned
board
atrocious
queenly
congregating
242-0800
414
yell
Commitment
IL
beluga
17.48
cordwood
high-gloss
died-in-the-wool
tax-avoidance
peeves
computer-equipment
Myra
Teton
shortcuts
louts
first-ranked
commodity-related
low
Griest
Monster
spermicidal
11.77
stark
AC
Doretti
Shelbourne
encumbering
156,445
indistinguishable
ABC.
Soviero
1,441
shareholder-approved
Kalil
Magne
cultivate
Lunnie
Euro-commercial
FG
nonprofessionals
Avia
stopper
septuagenarians
adulation
1.8118
A.W.
Takenaka
non-transferable
meddlesome
boy-meets-girl
146.9
Cite
motorways
Choate
Freaks
IOPOs
Esping
guv
understaffing
supporter
Mecom
maintenence
Muenchen
Eight
Pornography
Infectious
Poelker
Learner
raw-materials
AFFILIATES
1775
fixed-wing
20-story
flock
male-headed
Goffstown
Stark
13,900
Hoiles
passable
re-evaluating
mid-crop
sank
913,000
Salvesen
clerkship
unsaid
Lanesborough
defanged
Marino
Aliber
Shops
Huddleson
BVI
812.2
crawfish
Statesville
562.3
kingpin
14.17
footgear
Pyrrhic
hard-pressed
Lasso
6-
Martyre
Broadbent
Father
Cygnus
1,300-office
devices.
Immunochem
fur-buying
G-6
21,600
space-available
Retain
drizzle
pecs
Stress
JACKSON
Ala.
crucifixion
scribes
Transylvanian
14-inch
commingling
Massacusetts
decision-making
Falvo
pronouns
761.73
Energiverk
Steuben
95.71
top
Borders
DAF
porky
871,000
winches
Isomedix
doubtfully
photo-industry
ValCom
snowstorms
BICC
paternity
duets
Glennon
Joudrie
Catcher
plane
380.70
roll-up-your-sleeves
Hollihan
Rinaldo
loan-rescheduling
Torday
delinquencies
167,230
H.K.
copyrighting
Hoffstein
serialists
oddest
Annenberg
734.6
drought-assistance
KCI
Oxted
five-million-share
Reiterating
Winterland
tooth-fairy
tourneys
Kindergarten
Dastrup
Louis
grapevine
120-140
SkyWest
Kockums
repugnant
Dossey
absorbable
Ohio-built
A6
Amancio
underwhelmed
Mesirow
1,615
Month
Guerro
discard
69,333
immobilism
Romeo
arms-makers
Roberto
ENGLISH
baiting
marketplaces
trappers
proofreading
267.20
Stebbings
overwhelming
Auel
pre-cast
constricts
Mannion
Newell
Gummy
9,490
consecutive
Horovitz
Westover
Twins
bottoming-out
Martenson
469,700
Nordin
MultiFinder
mixed-income
5,000-a-year
toting
seeing
399,353
Queens
Pastilles
357
Motels
management/Goldman
545.4
7,500
collegians
Masterpieces
Syrian-Iranian
floated
Stripped
McCarron
6,499
early-1980s
26.375
tax-producing
Q-beta
amid
Mari
I.H.
3.337
Sciarra
Koop
steady-as-you-go
84.33
tetralogy
graphic-systems
HIGHEST
Grocer
Byrle
513,000
Nov.
road-building
Minneapolis/St
DANCE
extorted
Quebecois
automatic-shift
22-acre
1.8230
Syntex
ipso
securites
Visalia
INTERCABLE
937.8
Mooibroek
space-systems
ENTERPRISES
black.
high-priced
398,929
revue
circumvent
Vlok
Cammarano
Loh
capo
handicap
inanimate
Hasse
instituted
potash
Redman-Brown
NYC
warplane
Walters
Hirschfield
RECRUITING
fusillade
Tenant
WNET/New
MTECH
tuneups
brusquely
patent-leather
30000
239.30
Heren
kumquats
hot-dogging
million-pound
electronics-related
Toll-free
time
Flushing
lubricates
worse.
Sayers
853.13
optimist
concert-making
overdoses
Maucher
muffled
hurtling
McMahons
Omission
schoolkids
provable
1,000-dollar
Jarpa
Isotec
Jerome-Duncan
extinguished
Dyatron
Espenshade
Bixby
cross-examining
Junrong
Bocuse
1,810,000
embarrassment
Vivid
Exeter
Zagoria
237.3
Williston
Belgians
lob
Masked
1945-48
Liebling
FERRUZZI
connotes
Sturman
filth
scavengers
suffices
spokeman
warehouse-type
BHP
fanatics
Georgians
Murasky
bigot
well-scrubbed
Fijians
CFC-based
accordion
Dehecq
2,046,000
land-sale
surly
eclectic
Donut
Ellingson
alumna
Syosset
hooey
Ringwald
Mote
pre-independence
factly
2.86
commodity-dependent
Consoldiated
defroster
Medi-Cal
Procassini
MCDOUGALL
prolonged
call-processing
430.50
Debo
Gershowitz
561.2
chemcial
air-interdiction
Allingham
231.5
reloads
evocations
Flournoy
Christian-Marxist
academicians
1,000,000
AZP
animal-rights
Chiffon
preventive-care
Whatley
1,805
Robec
Roadmaster
Seizinger
Akhtar
Weightman
air-courier
Jai-alai
Connoy
166.25
30.8
vintage
426.60
FIELDER
71.6
sales-operation
Considar
Neumark
Husson
surplus
cloaking
Texas-grown
deliverability
burnings
ATKINSON
Lamprey
Buy-backs
Johnsonville
existed
Department-store
Kiev
14,000-member
Moen
Closely
abduct
trampled
gyro
Sanusi
company-financed
ENTERTAINMENT
lead-lined
11.80
racetracks
ETHICS
refugees
searcher
Roundtable
simulate
Tudor
Spandau
240.6
Chappe
34-year-olds
statuesque
Coniston
Paladin
0.0082
higher-resolution
incumbents
back-breaking
30.05
backwater
tips
porch
unworldly
occupational-safety
unhappier
Herman
world-competitive
Freda
rescreen
Lavely
Kahler
Rancho
6.385
Magcobar
four-horse
barking
30.99
ultra-high-speed
Significant
writedowns
honeycomb
Gratzon
vicious-dog
responding
Doane
15,160,000
Indiana
tormented
Cattle-futures
automating
Editions
Jamaican
Symptomatic
97.4
Amedo
post-1949
Dalis
Gilkey
afterlife
exposed
crumpled
mainframes
Slinn
2,407,000
0.0096
determines
anyhow
torpedo
mafiosi
Noberto
dozen
projectionist
flit
1.8115
Zoya
Nau
sculpted
simmers
verandas
large-quantity
precedence
reissue
raffles
Ferreira
199.95
ratting
Fawell
485.7
BONNEVILLE
98.50
todos
well-trained
pain-relievers
Byung
Maharashtra
Saxony
Peruano
agricultural-biotechnology
Euromarkets
nectar
Hivagen
modulations
Sunderland
silvery
strapped
interior-ministry
Schmude
prayed
Counting
minimalism
oddments
muffin
snagging
creditworthiness
76.1
transgression
Gainers
Baden
feral
Hillas
direct-marketed
Pine
Cerf
100-Share
Kulick
calculation-intensive
289,255
semi-rural
Orsini
Truckee
four-session
hurdles
military-reform
1,400-mile
reheat
B&C
Hazel
seven-game
gravitate
Spahn
paleface
130,500
bedlam
boils
Osborn
soon-to-be-published
Haugland
Shrontz
smolders
Reinaldo
Farisani
22.9
Formation
balletic
Evansville
clownish
Czechoslovaks
nai
domination
crates
Bromer
Janow
AER
Single-A-2
superstock
kite
smiled
multistage
Crutcher
whispery
developers
Hulkster
Mayerhofer
30-Aug.
2.24
PSC
Rudna
dispatchers
Siderurgica
224.9
Weidner
subbasement
Palestinian-Israeli
Satnick
mouthing
intimidates
132.86
laughingstock
Bricklin
Journalist
presently
Boughton
custom-chip
careens
go-slow
500SL
hirudin
platform
sardonic
henhouse
credit-policy
Ponski
partner-in-charge
Exchanges
liquidities
22.10
floodlights
short-sellers
Marzulla
example
cluck
Swath
chlorzoxazone
Saporito
throbbing
veers
Breckinridge
Buss
coal-miners
196,000
profit-based
verdicts
Morricone
Avemco
Retired
sync
organizes
Higley
surfer
pork
stucco
WORRY
Retlin
visible
sleuths
599.1
Toklas
Overtime
speedskating
McKee
dwellers
Deferral
LaVerne
rapport
247.3
Sisulu
133,870,000
Rendin
395.5
asset-redeployment
Paramax
SCIENCE
Creagan
nonideological
283,303
Faxing
Salonga
Seven-Year
evaporating
THEATER
Pella
wrecker
overage
Francek
checks
reverie
Goldman-Kidder
EBDCs
474
CALLING
Yasushi
2075.21
banalities
839.9
heartily
mainframe-software
disapproving
Weatherup
fortnightly
Purves
scandalously
Opcom
13/64-inch
urinates
Kodiak
transposed
test-fire
SleepTight
Saba
Probst
Thematic
donut
enduring
55-45
crankshafts
Seidl
Pineau-Valencienne
co-edited
electronic-surveillance
FOREIGN
Drell
5,950
124.97
electronics-distribution
Evel
Highveld
Hideaki
Itau
idiopathic
adjust
COMMISSION
Price/Stern
228,000
cables
15.8
illustrations
umpired
rock-throwers
contraindicated
existential
ADR
369.8
Viscount
untamed
tutorial
VOLVO
PC-XT
Baucus
Aeicor
marsh
Scary
coloristic
Disposable
multibillion-dollar
Smithkline
Pro-Life
DePere
hot-blooded
transcribing
Sharkey
7.375
Dameron
Flair
Tsugaru
Alzheimer's-like
1,280
Frew
NCR
Tenuta
1,450
cashflow
amends
Crabb
587
punk-rock
Peppermint
Helping
conclusion
Presque
Borsellino
TOOLWORKS
challenge-proof
sniffs
supplanting
leprosy
Cast
277.81
Zancanaro
Orestes
used-furniture
por
Arab
Madlock
bun
multi-windowed
Tunisia
rollicking
COVER
AIDS
3b-9
Petrauskas
991.8
retested
Matthew
Cappy
viaduct
toying
EWE
Gosbank
therapies
Hound
Pernod
ANZ
196.2
sleek-looking
Sward
439,000
Boer
4,980
ALPINE
Quietly
Jongkind
collision-damage-waiver
zoos
Nozko
substation
1982-1987
Housing-related
97.2
Tice
648.4
Marston
Anzola
technocratic
Nanking
u.s
Indulgence
Pereire
Qua
Carello
less-celebrated
197.1
colonial-style
DISC
4.24
Cantata
Wesray
militaries
vetoing
Hardin
oscilloscope
Weeda
TAKASHIMAYA
Bidlo
Trans-Alaska
looming
CSS-2
MTA
Brawn
1013.34
Environmentalists
McLeod
B-Cal
Trivest
trays
Scholey
Welk
Amauligak
Pountain
three-chamber
touchy-feely
genius
317.0
Bertolt
Northcote
Retinyl
heartbreakingly
summers
BIDEN
airfields
goer
spin-offs
UNK-INITC-DASH
Jackson
Guerlain
GROWERS
Cain-Sloan
Undermining
Quintessence
VPT391
pretreatment
banal
DeWolff
Bacal
MATIF
Antiquated
Karmazin
278
Nicaragua.
vortex
Wheelock
reschedule
high-mindedness
Dulwich
Battey
Gospels
340.3
rehabilitating
Sublette
well-grounded
0.5084
Congdon
dwindling
mythical
Shepley
below-average
burning
city-run
27869.36
Savaiko
Preventa
homelands
leathernecks
Rb
shrewdly
proclaiming
Arabian
Azcona
GIFTS
Kazuhiro
researcher
EGA
dribble
123,500
184.3
301.4
deer
schedulers
Tampa.
world-scale
COMPETENT
job-hunters
Indicating
Avner
screamed
Palcy
Fichera
TV-ad
victorious
45-page
Belleville
then-failing
hi-tech
Fujisawa
bladder
non-degreed
L.J.
cheese
reroute
cartwheeled
archaeologist
saber
Quintero
sick-child
Short-Term
social-insurance
noises
Condon
Pennex
Striar
Gilda
Concessionaires
McCabe
11.24
15.55
cherry
personal
52.25
Padwe
Antioquia
Hartger
-4
variousness
cropping
Yenakiyevo
openended
Deighton
telephone-equipped
hideously
Willcox
Tidings
aware
transfer
anti-Florida
22.49
Notary
DUTCH
Kasler
Carmella
stem-winding
earaches
395
crescent
overfilling
Conger
Rogge
wall-coverings
alumni
pre-recorded
airplay
Hitech
cross-complaint
Kwa-Zulu
cutting
prolonging
E10
13/16ths
Hooker
Yevgeni
Metviner
astrology
Ainsberg
precision
Chicagobased
Bundesbank
heirloom
19,900
14.09
Thumb
103.72
metabolism
Havener
Fuentes
ballroom
panther
transformed
poured-concrete
Kosan
dowries
Molecular
Pirko
non-attributable
anti-safety
Tuchman
2.92
Marohn
mid-South
Rogal
needless
monolog
transposing
Brunswig
Witch
Branson
remand
cash-producing
14-state
parking-garage
intramarginal
regrettable
sucre
Devonshire
1201.95
Otherwise
FINANCE
Montague
NICOR
Massacre
Haitians
Reichstul
bard
Superintendent
cardinal
indexing
Justinian
832
cafeterias
Grumbles
alternator
Jain
37.92
Marukin
bad-news
Karami
Associates
Sandler
work-authorization
six-week-long
beaver
Trustcorp
savants
17.15
liquor-pricing
catalyzed
47.3
99.5
SEIZED
Sequent
Indexes
Nacht
reserving
8:10
Fault-tolerant
snooze
debt-to-capitalization
Croasdaile
LeSignour
psyllium
mini-hub
President-elect
Maugeri
Tolchin
Orbison
compatriot
84.50
Summoned
Pancoast
1.6750
credulous
PASSED
10-week-old
copper-using
Eminence
Lassa
Louise
Pulitzer
AV
trioxide
McChesney
rebel-controlled
vacuum-tube
information-age
never-never
overused
forgets
Kirkuk
MAKING
turnip
stiffed
1256.47
sidestep
1929-1932
Nathaniel
Rosett
Izvestiya
Oxbridge
dissolutions
UNK-INITC-KNOWNLC-est
Armas
recycles
Ihlenfeldt
2566.42
megalopolis
68030-based
Juanito
Geschke
132.52
supposes
8th
MIDI
Camden
satchel
formalize
thesis
firehouses
aerospace-industry
cheerier
Kutcher
Halle
carbon-products
befalls
AMEV
choo-choo
Tedi
diverters
10.5
40.06
dedicate
Guarded
Kourou
gutsy
1.6113
hibernation
1.6085
influence
Bakeware
MEM
steeling
Gehry
fine-toothed
Neuhaus
Bio-Science
dramedy
strudel
Parking
fittings
Kurds
engine-builders
Genicom
26.06
Triton
parities
Co-sponsoring
Spokesmen
metal-alloy
7.68
shamelessly
Eyrie
trunks
Choice
mute
eight-day-old
zinnias
Moon
Iaco
lam
spinning-wheel
Mediagenic
Imuvert
saucepans
humanists
DELIVERY
Metaltech
spacebridges
Calculated
gnaws
IPO
Nathan
harebrained
place.
weightlifter
minicompact
Stalowa
policeman
insurance-product
then-employer
POLAND
job-security
audits
Gritzmaker
quarter-inch
solid-ink
large-capitalization
Lukas-trained
14.2
split-adjusted
Ralston
loin
colonists
forgiven
SAFECO
Italian-owned
operated
Metropolis
razing
witticisms
regales
employer-funded
1,980
congregations
lily-white
Powerlink
liars
latitudes
Presley
1890s
GPO
six-time
behaviors
catalog
mending
vacationing
Gayle
Ferran
mounting
ex-National
Claremont
swaying
159.37
Haan
SLI
15.96
Latham
underpayments
trade-processing
new-share
Okla
186.4
necesssary
Ochi
Langkau
299
605.9
sky-box
Kawa
1a
film
762
entertainer
812,500
docklands
Ing
formula-determined
healthy
Gyothen
madder
o'
Ranieri
1320
Everytime
marches
Rumania
securely
scoring
283,134
moos
cannons
co-directors
expression
Lightweight
2122.69
362,000
fortunate
playmate
Hubers
withdrawing
Polyethylene
laughingly
night-shift
Sandner
Brethen
mismarked
she-devil
anodyne
Titania
31.74
Riskier
13,400
322.8
Soviet-Cuban
805
8:05
129.4
rigger
Axe-Houghton
Airlie
Texaco-Saudi
roo
forego
embargo
snipes
Jarmusz
commodity-price
44.28
Dunkirk
crocs
Britannica
98.68
huggable
evict
nannies
136.54
game-playing
outstandingly
Simmert
pantomine
Ricker
concubines
head
Rover-c
Yamashita-Shinnihon
72.125
brake-pedal
McCombs
North-Rhine
unplanned
Relatively
privileges
Screen
non-welfare
Goal
Sleep
70-pence
4-April
subsided
branding
commits
ductile
marshland
Melanin
Therfectin
just-approved
blackest
Troupe
826.5
equate
Schur
insertion
351.74
individual-case
Anatoly
utility-supplied
Mylex
assemblymen
craved
Kazin
5:30
filthiest
Retaliation
Coffman
Fite
Ringier
acquiescence
Y-12
retail-ad
Crue
Shutt
intimate
streaked
segmented
Puerto
36.44
SHARK
1230
white-supremacist
758,000
32.50
Gabbert
tamper-resistant
Bench
applicable
pre-packaged
depression
capital-hungry
Acheson
Non-telephone
Mumm
bus-loads
Microwave
minable
Hydroscience
12-country
Zahmatkesh
Tal
Makeover
Neutrogena
ceremony
125.2
lubricating
Downy
Chiu
Recostruzione
bloodstreams
1.96
progesterone
paralleled
greenways
six-hour
Pooling
service-intensive
twinjet
Brown-Forman
one-for-10
Exchange-rate
eating
aus
archeologists
05
Taney
Szymanski
Glick
Stalls
Lube
Mosquito
Matton
676.8
fact-finder
133.9
search-warrant
Federalism
KGB-trained
Rhinos
automotives
world-weariness
Topgallant
R.F.
non-income
extricate
tended
9,000-member
Parkside
Elbe
Godot
Literati
Sofonias
bargain-rate
kabo
declare
454.70
Nesbeda
Eiszner
computer-training
Baram
Kaminstein
10:20
Hapag-Lloyd
knew
23.3
three-class
paleontology
Aranson
switch-gear
Pinch
Nishimatsu
Mangano
derive
Ducommun
Choo
Courtlemagne
Linsley
Stowe
effectively
savings-bond
scandals
80-minute
Uecker
also-ran
18-wheeler
7.5
65.6
poker-faced
exclude
misread
20.7
time-share
Sezaki
jestingly
LawPlan
Oram
59.7
Gilyarovsky
geophysical-exploration
10,580
Palley
Millions
Matskyavichyus
Bia-Cor
Starger
1987-Feb.
Options
CSU
printer
Chiefly
Sport-craft
48-a-share
Hedgecock
169.4
fu
63-year-old
more-conventional
44.67
PVCs
Asserting
175.98
65-pound
parklike
Oxonians
Sogevalor
Practical
Everingham
communications-satellite
Hadi
begins
15,150
ImmunoChem
691.5
shampoo
Separately
Stuyvesant
birdied
GoldCor
post-Khomeini
DRIVE-IN
534
Stebbins
additional
Leander
Feburary
Chlordane
Moreover
unheard-of
YELTSIN
homing
singlehandedly
computer-based
Scarecrow
TOTAL-CIE
Repeal
241.89
felt-tipped
dry-cell
undemanding
15-foot
prom
So-called
100.10
nearer
minister-designate
Equitex
82nd
sprinkler
Sword
scripting
Vipin
storyboard
Haugen
Caravati
ground-up
Lamhut
SCIENTISTS
wastewater
2.2-pound
Transkeians
genitalia
Czechs
1.6745
Caven-Atack
1991
8.82
self
queued
Lidgerwood
Pennslyvania
three-level
Anti-dumping
Blue-chip
GUNS
four-foot-long
toupee
PERSONNEL
132.98
193,000
Amnion
Massengale
4,050,000
171.22
save
c
synergistically
Reznichenko
displease
SOLD
360.5
266.9
Espousing
Tamayo
Lecturer
gore
approximation
amusement
tougher-minded
135.50
Associate
coaxed
unambiguous
laser-related
thermos-making
educations
energizing
nuclear-tipped
888,000
CENTEX
Goggins
weight-lifting
Samaras
sugared
unravel
Freer
66.625
83.3
left-hand
two-car
citrus-growing
twosome
virulent
gypped
powders
Diagnostics
dissect
ability
McCamant
remover
solitaire
Gaasbecks
spite
Graff
Hoechst-Roussel
Feruzzi
Mulanaphy
Kalamazoo
bearded
264,159
cement-distribution
winningest
10-11:30
co-equal
coupe
Penland
Armored
sealed-bid
941
1.53
scanner
Fabian
highlanders
145.50
Fadden
employee-severance
62.7
Polevoi
transistors
Bertram
145
Raisa
Pravda
Boguslavskaya
423.10
510,150,597
surrogate-mother
contriving
Radames
Walthall
idyll
1.6105
splendors
Osicom
Triple-X
Muenster
Soyuz
disenchanted
Goranin
white-coated
recordings
picture-taking
worsens
NW
SSI
kibitzer
tablet
Estuary
Litchman
hamper
baleful
leaguers
Tragedy
Auctions
fashionable
dressing
5,000-a-month
analogue
Dryomov
Dolores
DAVID
campaign.
22nd-largest
4,620
less-experienced
slab
50.2
Aancor
Goodhill
Reefs
2.51
113-page
Fodor
Minebea
21.35
carrental
Goth
realty
124.91
Boast
Italy-based
Meadvin
proprietary
hospital-inspection
20s
spittoons
FEMA
pacification
Klaiber
Picture
20.22
scriptwriter
self-perpetuating
blockheads
trapdoor
piggybank
Bombastic
1,351
Fashion
4.76
Light-truck
punctiliousness
Boz
Unger
Unfazed
handle
Sarcinelli
pre-teens
textual
766,000
Enticed
Sunflowers
Nyack
489
Cubicle
arrearages
BANK
data
biking
Acreage
Chaparral
Gammill
K.I.
Calvinist
daSilva
Gallup
hematology
Persistent
Dvorak
18-a-share
Callaway
Lighthizer
3,000-mile
20.98
Ariodante
144.75
consciously
legal-assistance
Foerster
Zwiebel
Kuben
Govil
stocked
gorges
globe-trotters
auto-da-fe
Richard
Evian
attack-dog
retirement-housing
Cincinatti
170.8
Balkan
Lobstermen
Jerusalem
211th
UMNO
Exceed
Lear
densities
Gavaghan
48.36
Ferranti-type
Sieber
hegemony
competitivity
gravelly
Falin
Okotoks
2086.59
computed
Ettore
Chauncey
1.8431
Strang
0.0107
Argilado
1.6825
snuffling
collections
Tomitsuka
Coretech
pooh-poohing
Felker
KABC
Broomberg
carte
Cimarrons
Sapanski
Mau
Yan
Burchuladze
Wigan
Uslico
1750
separationists
Entrenched
superpowerful
anti-Americans
Lazar
Blob
Terre
respecting
Zimbabwean
MX-6
LAPTOP
Appendix
Baton
pita
co-organizer
Penman
implode
PRK
140.2
Panicked
admonitions
French-government
aforethought
twilight
Glyco-Group
May-June
Patrikis
self-defeating
for-sale
Matagalpa
Chahbazian
zero-tolerance
grabbag
ConAgra
Allaire
clerkships
Hiroyasu
Guite
Caitlin
fair-employment
Exports
Crest
Corbu
Rulon-Miller
mujahideen
dramatized
Steinem
Sokolow
72nd
Sampie
Karla
Kippur
Clayman
leaguer
contest
Factoring
Verona
Gasser
Kassar
retirement
pin
Lollypop
aftermath
1,384,000
Imparc
fradulently
agricultural-products
disconcertingly
strike-free
444.2
38.6
Lannon
envisaged
386S
5,679,411
rate-cap
Roessner
miseries
1257.35
1263.06
shunting
mediators
230.8
Romer
Declining
Hard-line
tautology
enduser
1197.72
Dobrin
pumped
7.0485
marries
sulfuric
M&M/Mars
Wahlco
charting
trenchantly
screw-up
subtropical
Laurentian
billowing
Latvian
odorant-binding
36.15
Tells
lidocaine
promptness
pueblo
Pokrovskii
sales-force
Arion
Ecanal
Goebert
96.03
Marchese
675.4
embarrassing
stowing
.09
pains
phoned
99.68
un-Christian
Multifoods
-36
ejido
221
calliope
morning-sickness
busybody
526.2
prime-rate
whodunit
Facilities
snacks
kilobit
squirm
bureaucrats
Radiocor
Gordji
parternship
caviar
pewter
lavishness
Piety
dilutes
premium
Zambrano
comforted
97.56
around.
Mouline
2673.06
bourbon
1.8760
reveals
9,420,000
Emmonds
Faucher
Stalinism
puchase
exclaimed
thumps
untargeted
208.5
10,670
7,320
boding
mid-1996
hoops
casts
Bierstadt
239.1
artless
annoys
Siemer
Generra
foot
cavalierly
enamel
private-market
Apply
Johannesburg-based
visionaries
Clicquot
Seemann
extra-careful
dark-blue
Smyntek
documentary-style
Blatt
DuroTest
Turiel
Delight
mile-wide
Banca
talkative
multilateral
Johnstons
Etterbeck
GST
Highlands
25.91
Magdoff
Scheer
performances
Milpitas
vehicle-manufacturing
Krupman
Conason
exaggerates
formidable
fish
Schafer
Consistently
Damon
pronouncement
natural-born
Periodically
farrowings
Hjorth
SAN
461.8
appearances.
Eatz
Amen
single-child
STANLEY
KH-11
641.7
nick
bureauracy
Chipmunk
291.1
1238.49
Llovio
texts
Ovonic
Trafecanty
Hahn
non-aficionados
Step-Saver
McGinn
unfindable
Ediger
oil-stock
Epilepsy
synthesize
longhouses
larks
populating
TOURISTS
crevices
EXPENSIVE
deniable
Riddle
reflection
apprenticed
Barkeley
mainstay
voter-controlled
Guimaraes
intensifies
post-War
caseworkers
1317.50
Domeniconi
housing-code
Cardiac
Hoehn
Ryrie
LG-1
Chernobyl-style
extra-marital
Vernell
Hartzell
ULI
overfishing
11.36
685.3
KAMAN
Given
100,000-acre
probers
extended-hours
Olken
Sixty-eight
Bartels
Rickel
Anti-tax
936.6
Planecon
1.8533
transcripts
1,348
reiterates
scammed
IL-2
workturn
Deems
224.50
legislation
1,350
1,423
3.87
two-year-old
727,000
poem
Oath
3,475
Aposhian
serpent
Bouchard
AUDIOVOX
6-foot-8
proportionately
86B
27.11
dispenser
451.8
Amish
Marian
Beckley
Salvin
Pioe
41.34
maximally
Ironically
524.1
Nyet
Averaged
heyday
FarmFutures
129.66
BRUNEI
924S
APPELLATE
5.225
Datagate
submitted
PARC
cherishing
Favors
manicures
544.3
thins
Oblivious
electrician
shoot-outs
jobs
Fafner
Kangnam
ill-advised
SAS.
skittishness
67.19
borscht
tossup
DeVere
unseasonable
Cortez
then-prevailing
Broadfoot
Kaolin
Reagan/Bush
hopelessly
TELEFONICA
Wouters
Regaining
Well-intentioned
vintages
super-regulatory
cant
ACLU.
nights
give-aways
spavined
U.S.-traded
Conn.-based
jacaranda
Northumberland
Golde
Accepted
dogbite
2.6875
interspersing
Welburn
apologies
diversity
DV
Thirty-year
Shamu
6.53
178.2
Scanlon
pillows
Irani
recess-appointment
remarrying
941,000
Veins
Espiritu
ABT
Fully
Recipients
Yul
leaking
Malay
Wayzata
long-troubled
oncologist
price-performance
Hayden
Seiki
253.50
1298.66
car-distribution
Fitzwilliam
Khalifa
true-crime
Return
accession
perverting
Silvey
2.39
surgeons
961.48
1300.16
Year-earlier
rife
figurative
7.285
Iranian-held
288,970
Malden
CF6-80
marine-habitat
contests
indecision
Kissane
Pannone
565.2
patchy
bookkeeper
virology
lower-end
2613.04
decelerating
Ohshima
anti-Moscow
Rydge
elephant-like
trip-cancellation
Gondo
unventilated
Chrystal
DISEASE
403.90
1-6
Seratti
absorbency
Breazzano
Rauma-Repola
Salen
Hinton
Orthopaedic
Flo
refresh
DC-9-30
outcry
Buchan
Eggbeer
Biltis
put
Canterbury
125,774
Tatsumi
elucidate
Minto
EYE
non-Korean
superfluous
2104.47
CRL
server-training
Kongo
intimating
18.49
Predictably
46.39
bittersweet
Clippers
Crusades
deadlier
social-affairs
2244
consensus
falls
SBA.
martial-law
Mark-48
Criner
hundred-year
editorialists
adoration
IWC
reliant
1/8th
Auler
A-cars
Bavarians
Albertina
16-19
non-binding
Cellar
CFTC.
Backroom
Kazakhs
Tubbs
Faich
parlays
owned-property
coffeepots
grimmest
LIN-BellSouth
Riyad
492.5
wafts
15,000-to-1
637.5
Stambaugh
four-year
risk-return
7.42
conceptualize
470.6
Prokopis
sales-promotion
Stant
Westpride
427.9
stronger-than-usual
Kirten/James
10.76
pop-Darwinism
breakthroughs
constricting
lawfully
Gallium-arsenide
Octavian
26.40
732.2
207th
Mucha
readouts
Chilko
Matus
Feigenbaum
3000
Caymans
Antar-Belzberg
caricatures
1.6
7.69
Proodian
IADB
Fleeing
29-March
CARTER
Brie
394.15
boundless
detest
Boyajian
16:00-18:00
42.94
stranding
Smithfield
Fortunate
166.2
many-time
hustles
HUGO
Ebaugh
Northside
BNA
1,200-year-old
hard-rock
DDI
sandblasted
fob
Moles
ADD-Vantage
ticketing
Goldwater
Curler
Sentinels
995.1
double-overtime
283.2
298,223
Exchequer
STAGED
thawed
chromatographs
FNN.
Madame
EBS
Verisys
distributary
22.20
McSpadden
Cartusciello
price-discounting
medical-supply
manyfold
Naimoli
15/16
Jenks
ion
Cleghorn
pogrom
say
Puma
Smolensky
6.70
pulses
flats
20.45
Roster
DAIRY
Discouraged
Lucky-Alpha
public-employee
Fedorova
Pazienza
375.3
5,000-a-day
munches
6-Sept.
Filderman
2372.59
77.5
attention-grabber
4,950,000
2093.35
postcards
Mallory
leaps
Tryart
Bermon
SHELTER
bobsledders
forearms
fuel-system
thoroughbreds
Willott
horrendously
Fidelity-Fidelcor
230-page
distributorships
Orchestral
reargued
Moods
hog-slaughtering
Phantoms
Alerted
companionable
ex-Navy
Va
Brunch
ex-general
community-development
Transafrica
Compound
123.50
Wirtschafts
technical-workstation
weapon-launching
gravel-voiced
graduate-level
grittier
1.16
Oeverland
distinguishes
1,945,000
pestered
fireweed
48.50
blindfolded
Starckmann
weirdest
Falkenberg
syndromes
rials
dilution
fast-setting
93.27
Morgan
wring
populism
1.7752
Walk-in
glitch
Shuffle
Pattiz
Holliston
upper-class
microphones
Nadu
SGC
outboards
Favoring
Calmaquip
Publicker
Bagley
Goldstock
Langella
shoehorns
6.21
mawkishness
magenta
Named
full-dress
descrambler
expressionist
Usiminas
suites
Buecking
superstar
PipeLines
948.5
clash
Sanjiv
preplaced
Beltran
witholding
folkways
ceded
World-News
prison-release
heterogeneous
matchmakers
content-less
substantiation
underwithholding
Ohm
313,125
sedatives
C.G.
Mirror
Stupid
140-lawyer
summering
bearer
Najib
-to-2.5
880,000
stentorian
cookie-cutter
25-month
Upward
637.4
Orpheus
medium-dated
Mayans
Rhine
breakers
PENN
direct-payment
6.3350
computer-makers
105,000
49.12
DIW
Ingmar
1.7780
container-ship
Settsu
innovative
1,241,149
Secretary
Mediterranean
Vorontsov
KIC
crutch
trade-control
ventures
redeveloping
cartoons
arrival
Medicaid
Oppegard
co-produce
Albans
come-from-behind
Forsgren
fatherland
willed
Berts
Smahl
2.99
Concessions
Kerr
Providing
Stockholders
blood-spurting
tenfold
Distributing
Natan
high-strung
commmission
Pig
Hoskyns
Eckert
Clutching
Hustler
Erlap
Frederik
house-to-house
trespassers
Quilligan
Smaller
Shell
unit-holder
communism
likeness
Domestic-demand
Gamarci
Bara
tore
Pacad
6.10
Tomasson
2.07
4.995
cursors
shatter
430.7
1.055
new-products
Portuguese
Estenssoro
Schmetterer
desiring
comics
stock-swap
Canopus
Askew
turnouts
Pucci
0.0110
Sykora
Chopin
Introduce
shaver
survivalist
monochrome
44.3
Rubicon
teachers-union
Alexei
2339.20
major-appliance
tete-a-tete
Nazimeye
Citing
padlocked
burn
Folsom
73.60
1,890,000
housings
lizard
anticholesterol
8.393
nonimmigrant
Stigwood
Lyn
Rossi
pro-opposition
soulful
Informants
enrollment
Alice
USP
And
generates
tyrannical
nonissue
260.7
breeched
Vleminckx
Ozite
leakages
11,900
hierarchical
5-4
PLUNGED
loan-rate
colas
Congers
1.8136
Queux
Alma-Ata
billion-dollar-plus
Rediffusion
fault-tolerant
Bornecks
Ballpark
Welcomes
Hagstrom
Swed
cost-cutting
Sundstrand
Moor
Hill
Fierce
stable
461,000
ouzo
Griminger
Middlestadt
build-nothing
53-43
dissonant
averse
ECONOMICS
tomography
better-paid
Waymer
pickier
oil-dominated
Toshiaki
limit-order
Resnick
Al-Ahram
faulting
district-
4868
Surely
scleroderma
doll
1315.94
foreign-payoff
198.47
Ill
matriarchy
Odd-lot
Iwai
publically
297.05
trade-practices
stilled
maglevs
Mailgram
export-related
scrupulously
renominating
dauber
drawdown
57.97
post-split
Haunted
HANCOCK
predatory
plowing
latterly
wellspring
tumor
1781
Avianca
common-equivalents
358-67
18.2
clawing
quiche
2360.4
41.50
Air-traffic
3,595,729
30-Jan.
600.4
landlord-tenant
giver
Potzahr
Civilian
Biennale
Guiness
Starpointe
Billund
Tricorp
satanic
policy-makers
FASHION
lent
awe
pre-Broadway
27.50-a-share
club
RUB
Fittingly
50.3
handover
borrow-and-pay-back
Skull
Mavar
'N
pro
arraigned
Hildy
STREETS
overpay
tippling
2,039,300
spending-cut
dividers
abstaining
Kazutoshi
coral
65,000
Wotan
nagging
Rhineland-Palatinate
lags
single-volume
mannerist
Aires
Vitale
3,190
Strada
cartoon-like
Scylla
longs
county-wide
34.39
Amphenol
opt-in
mechanic
journalist
Came
photonic
1.6655
demand-driven
helper
veh
OGDEN
unofficially
Murchison
hackers
unpatrolled
Bien
Contracts
industrial-parts
Price/Stern/Sloan
front-loaded
NEVER
Peacekeeper
Gary-Wheaton
compensations
countercyclical
Doubtful
Grass
AirFreight
Nuggets
Sorbonne
Tunney
carnival-like
Runnette
C-word
exegesis
ITCHING
fixed-mortgage
1,580
bloods
Crowntek
second-story
Malawsky
pasta
luncheonette
Thirty-three
glass-edge
arrow
Taipei-based
Schreier
data-services
Boonstra
singlet
hiccuping
biscuits
Cheerios
2,198
IBM-style
Sparc-based
sour
Macfie
HIMONT
thankful
unpurchased
jacking
MPact
currency-reporting
11.64
1,738
Actigall
Tousignant
state-senate
123.65
lunging
4-9
cash-method
non-members
crater
Soviet-equipped
21-30
HUCTW
Papp
Katushev
HealthCare
The
134.15
splattered
Bangalore
195-pound
skill-training
McTeague
1.5880
SunGroup
Substances
prompted
Absurd
Palestinian-Jordanian
RTL
Lady
preparatory
Letterer
GB-Inno
Texaco-Icahn
Marla
specialty-printing
sagging
Slowik
steeplechase
Boasts
waistline
244.3
commercialize
Roque
re-indicted
actor-director
ETABLISSEMENTS
2,101,000
MFS
Nietschmann
revenue-needy
IGB
Everington
parenteral
Camry
Knutz
Cloisters
desks
Lilley
Newfoundland
refilling
Burnsville
Smokey
Blauer
Moraga
repose
Kraeutler
crime
walk-ins
two-for-one
skateboarding
greasing
unaudited
Anselmo
cheapening
drumbeating
Emir
glass-related
Attendance
ALONE
Caithness
bankrolled
Hardgoods
PruCapital
Capshaw
world-trade
1.35
DEEP
CCH
supervoting
Statisticians
Semiotics
Wig
shoddily
Eigen
Alachlor
Chelmsford
GROUPS
screeching
lavishing
Almoayed
EQUIPMENT
24.43
picture-tube
Di
pro-West
Sheffer
Castelli
Slifka
Tastykake
less-than-enthusiastic
DeNunzio
pre-existing
Nicolin
1885
aerospace/defense
anti-Marxist
securities-laws
Lewin
fun-seekers
vanillin
appraises
cochairman
procrastinated
abetting
tuneless
packers
Farm
2,950
draining
133.60
CLUB
OPERATING
FORMS
job
Household
all-paper
Companywide
May-the
Panem
12:30
jigsaw
658
McInerney
Windahall
Processing
Zinman
122.55
profitable
napalm
Velma
frailty
interdiction
TEA
senator
present
Saabye
Crigler
can
salary-deferral
ribbons
PRIVATE
JCAH
ghetto
Altus
apprenticeship
Jewel
707
Tammen
radar-guided
Cistron
industrial-era
alike
45.6
stone-washing
epochal
Hempleman
miseducation
tissue
encoding
scourge
Cal-Abco
sibilant
inhabit
absorber
disquisition
Leftists
Kushner
pried
'40
VAULT
Bebear
bolivars
collaborate
Coventry
Responsive
minibudget
self-analysis
preschooler
recite
Minutes
enactment
Luzenac
IEA
1,399,000
1,070
Volodarsky
Verner
sexism
Qhupaq
Wexler
plastic-body
chirped
610
143.90
padding
Hambro
Horizons
wowing
Gotschall
IBMer
Meese
Candela
six-point
Yikes
ILWAS
convoy
Votes
BRIEN
HEICO
1.6765
6,330
electricians
TURNOVER
GROEP
Willits
premature
Gushchin
self-inflicted
Metromedia
half-percentage-point
Consult
high-rise
gambling-related
Zeus
himself.
Gruy
overreach
Segre
150-pound
silver-oxide
peacemakers
aphids
customer-oriented
Soviet-Japanese
mousetraps
self-loathing
export-sales
Churm
H.L.
Schwerin
Lamm
Ballves
1.8373
scramble
24.70
Bendetti
Shuttle
worshipers
unconnected
Ratio
Materiel
bogeyman
3,540
Silkman
forging
phonetically
Allmon
FLX
Manfredi
Cross-margining
361
Miyata
piggybacking
obstetrician-gynecologist
ol
modified-atmosphere
Glassell
Lichty
CDW
Hear
209,204
Kaina
Protectionists
bluish
three-phase
silver-painted
extenuating
2,140
302.7
Lending
censoring
Sec.
vinegars
ignorance
rucksack
Capitalization
4:20
Rory
lawmaking
Compass
coffeehouses
6.18
ECOLOGY
majority-held
AMES
ten
Wittgenstein
unevenness
Groveman
sterility
LWRs
sidestepping
smartly
Grease
paneling
Fredonia
vitriol
shake-out
26.90
Iorio
994
embyro
Abound
Khazei
infant
Discreet
Mercifully
snowmobiles
Belvidere
disorders
389.1
marching
Siegal
equitably
Radiator
supine
Coaxial
Equitrack
0.0140
Satellite
Caddell
Xebec
Chadonic
chiselers
Fixed
650-seat
Buffalo-area
Kolberg
acquistions
bombastic
entryways
5-8
low-rate
Scents
ratios
195.7
6,690
incorporate
Mentor
Polyana
Chamberlayne
devastatingly
793
champagnes
routines
Monterey
Senses
billion-guilder
Verlin
traveled
anted
Zollo
corpses
song-slide
Output
runup
disbelieved
Vietnamese-American
approve
halt
mitigated
hangovers
Hallo
296.57
scavenging
revenue-generating
958.1
134.74
305.86
YMCAs
Gang
don
Bergstrom
vote-tallying
Holsinger
nonstriking
Groseclose
Alawi
Stovall
harmfully
more-informal
Zagorsk
state-funded
plasterers
SmartLease
PC.
winning
110-meter
1,351.50
85.9
inaptly
fees
1.9711
Roberston
fadeout
Prescott
rationally
Cunniff
Cavaney
immigration-reform
pleasant
Cargill
Spengler
507.7
scuffler
145,386
Bemidji
unshakable
placard
Weird
Moller
108.96
Prades
infertile
resignees
53.6
IIe
i
junior-high-school
29.375
Bruss
Chicle
Strapped
calving
Gehlsen
131.08
15.641
CHICKEN
pyramided
Schlott
Octavia
66.55
53.81
Ruggles
Interflug
14th-largest
put/call
>7
F-18
Greene/Worldwide
DeBraal
BOOSTS
510
490.6
Dec
devilish
Canadian-controlled
Conran
residue
near-surface
Scratching
too-strong
35.07
valuable
Prechter
Price-Fixing
bathing-suit
Intratec
Grossinger
Chengbei
setpoint
recreational-vehicle
11.91
TemPositions
hurricane
tensions
Stober
GMHC
Billie
spreads
insurance-service
482.5
McVay
477.10
Marlite
MortgagePower
Bostock
1846.82
Belfast
particular
9.886
Uni-Marts
rectitude
della
breeds
474.8
spring-loaded
Halder
albatross
Kosonen
Zales
skyward
Among
spawning
bylines
Non-tariff
119.7
complainants
Liddell
retrogressive
civility
Shy
Powlen
2679.52
skin-care
1,595,000
Cumulative
Clemenson
Macko
41.625
subjectivism
7,200
Cyclades
Heffering
34,600
d'Electro-Resistance
loaners
41.1
Vlasov
1.8178
tribunals
leaders
Kanak
705.9
Ryuichi
Walid
Mesa-led
dominated
Chinese-owned
investible
benefit-to-cost
2.5-mile
910.5
near-continuous
checklist
Taher
pottery
Pitselos
Gotshal
co-sponsor
Amfac
Shotland
701.2
919.2
liquefied-petroleum-gas
delegators
surveying
boodle
THRIFTS
Inds
stockholders
Milano
blame
PCB-contaminated
ITN
Periogene
Kocur
VAXstations
dividends-received
productively
585.3
Gieszl
Kidnappers
airpower
Hochstim
petits
unimpressed
AEROSPATIALE
Goru
Lowin
hooky
hillocks
mismanagement
securities-lending
Italian-based
overcooked
well-tried
125.9
2,612
Ava
Modell
3.
98.9
649
162.92
1356
7.00
suspenders
163,400
1966.75
Fudosan
197
Interpharm
Fass
Citrosuco
broach
gold-leaf
Wilmington
Filtrol
Paylan
1252.79
underwriting
Magistrate
PowerPoint
GenCorp.
Ouchi
1-AB
bounce
super-fast
racked
Reorganize
7.948
price-matching
Golann
Was
Burenga
CANDIDATE
SALESPEOPLE
highyield
Blinn
Nightmare
7.1725
awfully
renationalize
Arix
teleport
defense-policy
CAPITAL
Perfumes
Happen
non-hotel
41.6
Sasso
supermarket-chain
reinsurers
2561.38
off-patent
stopovers
shiny-domed
encodes
IJ
Sentman
579.4
plastic
carpet-cleaning
Colombians
undermining
FSC
economic-liberalization
non-socialist
bodyguard
clerked
284.9
Isaacs
strategic-missile
cubbyhole
Sidwa
metallurgist
real-sports
anlaysts
Hocker
IVAN
Hering
Kuban
225-share
confectionery
109.1
Pelligrino
UNHCR
Martyn
shooters
cafe
Started
asterisk
nubile
dissolves
reconnoitered
Humboldt
Charney
retry
382.8
Wetherby
techie
Hock
Crabs
Generating
VOTING
47.7
less-favorable
29.55
Harpoon
cape
Saluter
Colonus
unbearable
Charlevoix
Lawsuits
Kritzer
Bromfield
exactly
Liebe
castanets
OK.
absurdly
27000
million-unit
Mackrel
symphonies
Wheeling-Pitt
Mitchel
Midway
Initiatives
219.9
Calvert
daily-selling-rate
Kies
Mankato
methanol-gasoline
convent
Mystery
HTL
criminalized
6,550
agencies
teaspoonful
Corydon
mass-marketed
factory-outlet
Invitation
33.72
paratungstate
Trainer
Appelo
well-practiced
Maclean-Hunter
surrender
personal-computer-based
conventionally
30.23
functional
EB
424.4
windfall-profit
steelmakers
endow
shareholder-search
wilderness
Kynar
truck
Myerson
2297.94
EAST
TEDs
707s
449.6
tap-dance
Cleve
settlers
four-channel
Nilgeses
profitablity
Javelin
rural-development
Moderation
truth-in-advertising
Gus
Reaganomics
swings
look-alikes
